# Join

In [1]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20,30,40],"D":[11,22,33,44]})

var1.join(var2)

   A   B   C   D
0  1  11  10  11
1  2  12  20  22
2  3  13  30  33
3  4  14  40  44

agar hm C & D se data ko km kr de to jha data km hoga vha NaN show hoga

In [2]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]})

var1.join(var2)

   A   B     C     D
0  1  11  10.0  11.0
1  2  12  20.0  22.0
2  3  13   NaN   NaN
3  4  14   NaN   NaN

from the above code we know jb bhi hm unmatched data ko dalte hai tb bhi join function properly work karta hai

hm dataframe ka index bhi change kr skte hai

In [4]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var1.join(var2)

   A   B     C     D
a  1  11  10.0  11.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

agar hm C , D ko aage and A,B ko pichhe karna chahte hai than use

In [5]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var2.join(var1)

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

but agar hme sari hi value chahiye than use how parameter

In [6]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var2.join(var1,how="left")

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

In [7]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var2.join(var1,how="right")

      C     D  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

using outer for the union data

In [8]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var2.join(var1,how="outer")

      C     D  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

using inner for the intersection data

In [9]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])

var2.join(var1,how="inner")

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

agar hm column name same rakhke join kare to error show hoga. But using the function of lsuffix hm runtime me bhi column name ko change kr skte hai

In [10]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])

var2.join(var1,how="outer",lsuffix="_12")

      C  B_12  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

agar hm right suffix ko change karna chahte hai than use rsuffix

In [11]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])

var2.join(var1,how="outer",lsuffix="_12",rsuffix="_123")

      C  B_12  A  B_123
a  10.0  11.0  1     11
b  20.0  22.0  2     12
c   NaN   NaN  3     13
d   NaN   NaN  4     14

lsuffix & rsuffix could be same

In [12]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])

var2.join(var1,how="outer",lsuffix="_12",rsuffix="_12")

      C  B_12  A  B_12
a  10.0  11.0  1    11
b  20.0  22.0  2    12
c   NaN   NaN  3    13
d   NaN   NaN  4    14

# Append

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])

var1.append(var2) # Append concept is removed from pandas 2.0 now we use Concat method

# Concat

In [14]:
import pandas as pd

var1 = pd.DataFrame({"A": [1, 2, 3, 4], "B": [11, 12, 13, 14]}, index=["a", "b", "c", "d"])
var2 = pd.DataFrame({"C": [10, 20], "B": [11, 22]}, index=["a", "b"])

result = pd.concat([var1, var2])
print(result)

     A   B     C
a  1.0  11   NaN
b  2.0  12   NaN
c  3.0  13   NaN
d  4.0  14   NaN
a  NaN  11  10.0
b  NaN  22  20.0

In the above code sare data merge ho chuke hai

if we want to remove the index value than data follows 0 1 2 ... formate.

In [15]:
import pandas as pd

var1 = pd.DataFrame({"A": [1, 2, 3, 4], "B": [11, 12, 13, 14]})
var2 = pd.DataFrame({"C": [10, 20], "B": [11, 22]})

result = pd.concat([var1, var2])
print(result)

     A   B     C
0  1.0  11   NaN
1  2.0  12   NaN
2  3.0  13   NaN
3  4.0  14   NaN
0  NaN  11  10.0
1  NaN  22  20.0

hamne 2 data ko append kiya hai to index 0 1 to 0,1 repeate hua hai, but agar hm chahte hai ki ye ek sequence me show ho than use ignore_index = True

In [18]:
import pandas as pd

var1 = pd.DataFrame({"A": [1, 2, 3, 4], "B": [11, 12, 13, 14]})
var2 = pd.DataFrame({"C": [10, 20], "D": [11, 22]})

result = pd.concat([var1, var2], ignore_index=True)
print(result)

     A     B     C     D
0  1.0  11.0   NaN   NaN
1  2.0  12.0   NaN   NaN
2  3.0  13.0   NaN   NaN
3  4.0  14.0   NaN   NaN
4  NaN   NaN  10.0  11.0
5  NaN   NaN  20.0  22.0